Repository: humazed/flutter_toolbox
Catalog: res/values/strings_*.arb
Languages: ar

source: Required Field
ar: حقل مطلوب

source: Please check your connection
ar: تأكد من وجود انترنت

source: Server error
ar: خطأ من الخادم حاول مرة اخري

source: The email address or password is wrong
ar: البريد الإلكتروني او كلمة المرور غير صحيحة

source: This file is not an image
ar: هذا الملف ليس صورة

source: Select time
ar: إختر الوقت

source: Select date
ar: إختر التاريخ

source: Please check your internet connection
ar: الرجاء التاكد من اتصالك بالأنترنت

source: Search...
ar: إبحث...

source: Could not launch google maps
ar: لا يمكن فتح خرائط جوجل

source: Couldn't open this url
ar: لا يمكن فتح هذا الرابط

source: Couldn't open the mail app
ar: لا يمكن فتح تطبيق البريد الإلكتروني
